module.exports.config = {
  name: "autotimer",
  version: "2.0",
  role: 0,
  author: "Dipto",
  description: "সেট করা সময় অনুযায়ী স্বয়ংক্রিয়ভাবে বার্তাগুলি পাঠানো হবে!",
  category: "AutoTime",
  countDown: 3,
};

module.exports.onLoad = async ({ api }) => {
  const timerData = {
      "12:00:00 PM": {
        message: "⌚┆এখন রাত ১২টা বাজে\n❥︎খাউয়া দাউয়া করে নেউ,😙🌞 🌟",
        url: null
      },
      "01:00:00 AM": {
        message: "⌚┆এখন রাত ১টা বাজে\n❥︎সবাই শুয়ে পড়ো,🤟🌜🌟",
        url: null
      },
      "02:00:00 AM": {
        message: "⌚┆এখন রাত ২টা বাজে\n❥︎প্রেম না কইরা যাইয়া ঘুমা বেক্কল,😾🌜🌟",
        url: null
      },
      "03:00:00 AM": {
        message: "⌚┆এখন রাত ৩টা বাজে\n❥︎যারা ছ্যাকা খাইছে তারা জেগে আছে,🫠🌜🌟",
        url: null
      },
      "04:00:00 AM": {
        message: "⌚┆এখন রাত ৪টা বাজে\n❥︎ফজরের প্রস্তুতি নাও,🌜 🌟",
        url: null
      },
      "05:00:00 AM": {
        message: "⌚┆এখন সকাল ৫টা বাজে\n❥︎নামাজ পড়ছো তো? ❤️🌜🌟",
        url: null
      },
      "06:00:00 AM": {
        message: "⌚┆এখন সকাল ৬টা বাজে\n❥︎ঘুম থেকে উঠো সবাই,🌜 🌟",
        url: null
      },
      "07:00:00 AM": {
        message: "⌚┆এখন সকাল ৭টা বাজে\n❥︎ব্রেকফাস্ট করে নাও,😊🌜🌟",
        url: null
      },
      "08:00:00 AM": {
        message: "⌚┆এখন সকাল ৮টা বাজে\n❥︎কাজ শুরু করো মন দিয়ে,❤️🌜🌟",
        url: null
      },
      "09:00:00 AM": {
        message: "⌚┆এখন সকাল ৯টা বাজে\n❥︎চল কাজে মন দিই!🌜 🌟",
        url: null
      },
      "10:00:00 AM": {
        message: "⌚┆এখন সকাল ১০টা বাজে\n❥︎তোমাদের মিস করছি,🌞 🌟",
        url: null
      },
      "11:00:00 AM": {
        message: "⌚┆এখন সকাল ১১টা বাজে\n❥︎কাজ চালিয়ে যাও!🌞 🌟",
        url: null
      },
      "12:00:00 PM": {
        message: "⌚┆এখন দুপুর ১২টা বাজে\n❥︎ভালোবাসা জানাও সবাইকে,❤️🌞🌟",
        url: null
      },
      "01:00:00 PM": {
        message: "⌚┆এখন দুপুর ১টা বাজে\n❥︎জোহরের নামাজ পড়ে নাও,😻🌞🌟",
        url: null
      },
      "02:00:00 PM": {
        message: "⌚┆এখন দুপুর ২টা বাজে\n❥︎দুপুরের খাবার খেয়েছো তো? 🌞 🌟",
        url: null
      },
      "03:00:00 PM": {
        message: "⌚┆এখন বিকাল ৩টা বাজে\n❥︎কাজে ফোকাস করো,🌞 🌟",
        url: null
      },
      "04:00:00 PM": {
        message: "⌚┆এখন বিকাল ৪টা বাজে\n❥︎আসরের নামাজ পড়ে নাও,🥀🌞 🌟",
        url: null
      },
      "05:00:00 PM": {
        message: "⌚┆এখন বিকাল ৫টা বাজে\n❥︎একটু বিশ্রাম নাও,🌞 🌟",
        url: null
      },
      "06:00:00 PM": {
        message: "⌚┆এখন সন্ধ্যা ৬টা বাজে\n❥︎পরিবারকে সময় দাও,😍🌞🌟",
        url: null
      },
      "07:00:00 PM": {
        message: "⌚┆এখন সন্ধ্যা ৭টা বাজে\n❥︎এশার নামাজ পড়ো,❤️🌜🌟",
        url: null
      },
      "08:00:00 PM": {
        message: "⌚┆এখন রাত ৮টা বাজে\n❥︎আজকের কাজ শেষ করো,🌜 🌟",
        url: null
      },
      "09:00:00 PM": {
        message: "⌚┆এখন রাত ৯টা বাজে\n❥︎ঘুমের প্রস্তুতি নাও,🌜 🌟",
        url: null
      },
      "10:00:00 PM": {
        message: "⌚┆এখন রাত ১০টা বাজে\n❥︎ঘুমাতে যাও, স্বপ্নে দেখা হবে,🌜 🌟",
        url: null
      },
      "11:00:00 PM": {
        message: "⌚┆এখন রাত ১১টা বাজে\n❥︎ভালোবাসা রইলো,🌜 🌟",
        url: null
      }
  };
  if(timerData){
const checkTimeAndSendMessage = async() => { 
  const currentTime = new Date(Date.now() + 21600000).toLocaleTimeString('en-US', {
    hour: '2-digit',
    minute: '2-digit',
    second: '2-digit',
    hour12: true
  }).split(',').pop().trim(); 
  // const attachment = await global.utils.getStreamFromURL(timerData[currentTime].url);
  
    if (timerData[currentTime]) global.GoatBot.config.whiteListModeThread.whiteListThreadIds.forEach(async threadID => await api.sendMessage({body: timerData[currentTime].message/*, attachment*/}, threadID)); 
    setTimeout(checkTimeAndSendMessage, 1200 - new Date().getMilliseconds()); 
   }; 
  checkTimeAndSendMessage();
 }
};

module.exports.onStart = ({}) => {};
